Tiket1/src/DataProcessors/ЗаполнениеГрафика/ЗаполнениеГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеГрафика</name>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.Графики</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Tiket1/src/InformationRegisters/ГрафикиРаботы/ГрафикиРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикиРаботы</name>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>График</name>
    <type>
      <types>CatalogRef.Графики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tiket1/src/Catalogs/Графики/Графики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Графики</name>
  <predefined>
    <items>
      <name>Пятидневка</name>
      <description>Пятидневка</description>
    </items>
    <items>
      <name>Шестидневка</name>
      <description>Шестидневка</description>
    </items>
  </predefined>
</mdclass:Catalog>

Tiket1/src/DataProcessors/ЗаполнениеГрафика/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет графики в зависимости от выбранных параметров
//
// Параметры:
// График - СправочникСсылка.Графики
// ПериодДействия - Структура
//
Процедура ЗаполнитьГрафик(График, ПериодДействия) Экспорт
	
	НаборЗаписей = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.График.Установить(График);
	
	ЧислоСекундВСутках = 86400;
	
	НачалоПериода = ПериодДействия.Начало;
	КонецПериода = ПериодДействия.Конец;
	
	Пока НачалоПериода < КонецПериода Цикл
		
		Запись = НаборЗаписей.Добавить();
		Запись.График = График;
		Запись.Дата = НачалоПериода;
		Если График = Справочники.Графики.Пятидневка Тогда
		
			Если ДеньНедели(НачалоПериода) = 6 Или ДеньНедели(НачалоПериода) = 7 Тогда
				Запись.КоличествоДней = 0;	
			Иначе
				Запись.КоличествоДней = 1;
			КонецЕсли;
			
		ИначеЕсли График = Справочники.Графики.Шестидневка Тогда
			
			Если ДеньНедели(НачалоПериода) = 7 Тогда
				Запись.КоличествоДней = 0;	
			Иначе
				Запись.КоличествоДней = 1;
			КонецЕсли;
			
		КонецЕсли;
		
		НачалоПериода = НачалоПериода + ЧислоСекундВСутках;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
